Revit 2027 API
Alignment.StartStation Property
 Specifies the station at which the alignment's geometric definition starts, in Revit internal model units (standard Imperial feet).
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartStation { get; }
Public ReadOnly Property StartStation As Double
	Get
public:
property double StartStation {
	double get ();
}
member StartStation : float with get
Property Value
Double
Remarks
 This station may be outside the displayed range (DisplayedStartStation, DisplayedEndStation).
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace